#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std; //öå äîçâîëÿº íå ïèñàòè êîæíîãî ðàçó std 


//11 âàð³àíò Äàíî äâîâèì³ðíèé ìàñèâ ç N*N ö³ëèõ ÷èñåë. Ïîìíîæèòè ìàòðèöþ ñàìó íà ñåáå (â³äïîâ³äíî äî ïðàâèë ìíîæåííÿ ìàòðèöü – âèêîðèñòîâóâàòè êâàäðàòí³ ìàòðèö³).


// ß â³ðèøèâ çðîáèòè çàïîëíåííÿ ìàñèâó àáî ìàòðèö³ øëÿõîì ðàíäîìó, à íå çàäàíèé þçåðîì, íà ìîþ äóìêó öå òðîõè êðàùå òà ö³êàâ³øå âèãëÿäàº 


int main() {
    srand((int)time(0));


    int n;
    cout << "Enter n: "; //ðîçì³ð ìàòðèö³
    cin >> n;
   




    //ñòâîðþºìî ìàñèâ ÿêèé áóäå ðàíäîìíî çàïîâíåíèé 
    double** a = new double* [n];
    for (int i = 0; i < n; i++)
        a[i] = new double[n];


    // ìàñèâ â³äïîâ³äü òîáòî ìàòðèöÿ ïîìíîæåííà íà ñåáå
    double** c = new double* [n];
    for (int i = 0; i < n; i++)
        c[i] = new double[n];


    
    // çàïîëíþºìî ìàñèâ ðàíäîìíèìè ÷èñëàìè òà éîãî âûâîä (âñ³ ÷èñëà íå á³ëüøå 9)
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            a[i][j] = rand() % 9 + 1; // çàïîâííåíÿ ðàíäîìîì
            cout << a[i][j] << " ";
        }
        cout << "\n";
    }


    //çàïîâíèâ ìàñèâ ñïî÷àòêó íóëÿìè íóëÿìè. 
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            c[i][j] = 0;
            
        }
    }


    cout << "\n";
  
    // ìíîæåííÿ ìàòðèöü òà âûâîä ð³øåííÿ
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            for (int g = 0; g < n; g++) {
                c[i][j] += a[i][g] * a[g][j];
            }
            cout << c[i][j] << " ";
        }
        cout << "\n";


    }


    


    
}