#include <iostream>
// Çàäàíèé îäíîì³ðíèé ìàñèâ À(10). Çíàéòè äîáóòîê âñ³õ íåâ³ä’ºìíèõ åëåìåíò³â ìàñèâó.
int main() {
        const int MaxN = 10; // âñòàíîâëþºìî ðîçì³ð ìàñèâó.
        int A[MaxN]; // ñòâîðþºìî ìàñèâ ðîçì³ðîì MaxN òîáòî 10




        std::cout << "Enter ten numbers: "; // êîðèñòóâà÷ çàïîâíþº ìàñèâ ç 10 ÷èñåë 
        std::cin >> A[0];
        std::cin >> A[1];
        std::cin >> A[2];
        std::cin >> A[3];
        std::cin >> A[4];
        std::cin >> A[5];
        std::cin >> A[6];
        std::cin >> A[7];
        std::cin >> A[8];
        std::cin >> A[9];




        int i = 0;    //çì³ííà äëÿ öèêëó
        int sum = 0; // çì³ííà â ÿê³é áóäå ñóìà âñ³õ íåâ³ä’ºìíèõ ÷èñåë.


        while (i < MaxN) { // ÷åðåç öèêë ïðîõîäåìî âåñü ìàñèâ òà çàïèñóºìî âñ³õ íåâ³ä’ºìí³ åëåìåíòè ó çì³ííó sum.
                if (A[i] > 0) { // ïåðåâ³ðêà íà íåâ³ä’ºìíå ÷èñëî 
                        sum += A[i]; // ÿêùî ÷èñëî íåâ³ä’ºìíå òî éîãî äîäàþò ó çì³ííó sum
                }
                i++;
        }
        std::cout << sum;
}